---
title: PipeInsulation
classe: Autodesk.Revit.DB.Plumbing.PipeInsulation
namespace: Autodesk.Revit.DB.Plumbing
eredita: Autodesk.Revit.DB.InsulationLiningBase
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# PipeInsulation

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `PipeInsulation Create(Document, ElementId, ElementId, Double)` | `PipeInsulation.Create(document, pipeOrContentElementId, pipeInsulationTypeId, Thickness)` | PipeInsulation |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```